arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_adi_4_aux.h
// Field:     [5] IOMUX
//
// Connect ADC reference to AUXIO7
#define ADI_4_AUX_ADCREF0_IOMUX                                     0x00000020
#define ADI_4_AUX_ADCREF0_IOMUX_BITN                                         5
#define ADI_4_AUX_ADCREF0_IOMUX_M                                   0x00000020
#define ADI_4_AUX_ADCREF0_IOMUX_S                                            5

// Field:     [4] EXT
//
// External reference enable:
//
// 0: Reference output pulled low when EN = 0
// 1: Reference output high impedance when EN = 0
#define ADI_4_AUX_ADCREF0_EXT                                       0x00000010
#define ADI_4_AUX_ADCREF0_EXT_BITN                                           4
#define ADI_4_AUX_ADCREF0_EXT_M                                     0x00000010
#define ADI_4_AUX_ADCREF0_EXT_S                                              4

// Field:     [3] SRC
//
// ADC reference source:
//
// 0: Fixed reference = 4.3V
// 1: Relative reference = VDDS
#define ADI_4_AUX_ADCREF0_SRC                                       0x00000008
#define ADI_4_AUX_ADCREF0_SRC_BITN                                           3
#define ADI_4_AUX_ADCREF0_SRC_M                                     0x00000008
#define ADI_4_AUX_ADCREF0_SRC_S                                              3

// Field:     [0] EN
//
// ADC reference module enable:
//
// 0: ADC reference module powered down
// 1: ADC reference module enabled
#define ADI_4_AUX_ADCREF0_EN                                        0x00000001
#define ADI_4_AUX_ADCREF0_EN_BITN                                            0
#define ADI_4_AUX_ADCREF0_EN_M                                      0x00000001
#define ADI_4_AUX_ADCREF0_EN_S                                               0

//*****************************************************************************
//
// Register: ADI_4_AUX_O_ADCREF1
//
//*****************************************************************************
// Field:   [5:0] VTRIM
//
// Trim output voltage of ADC fixed reference (64 steps, 2&#39;s complement).
// Applies only for ADCREF0.SRC = 0.
//
// Examples:
// 0x00 - nominal voltage 1.43V
// 0x01 - nominal + 0.4% 1.435V
// 0x3F - nominal - 0.4% 1.425V
// 0x1F - maximum voltage 1.6V
// 0x20 - minimum voltage 1.3V
#define ADI_4_AUX_ADCREF1_VTRIM_M                                   0x0000003F
#define ADI_4_AUX_ADCREF1_VTRIM_S                                            0


#endif // __ADI_4_AUX__
